<?php declare(strict_types=1);

return [
    'App\Enums\NotificationActivityType'=>[
        1 => 'پیام همگانی',
        2 => 'پسندیدن دیدگاه',
        3 => 'پاسخ به دیدگاه',
        4 => 'مدیریت',
    ],
    'App\Enums\CommentStatus'=>[
        1 => 'در انتظار تایید',
        2 => 'تایید شده',
    ],
    'App\Enums\OrderStatus'=>[
        0 => 'جاری',
        1 => 'در انتظار تایید',
        2 => 'لغو شده',
        3 => 'مرجوع شده',
        4 => 'تکمیل شده',
    ],
    'App\Enums\UserType'=>[
        1 => 'شخص',
        2 => 'شرکت',
    ],
    'App\Enums\UserGender'=>[
        1 => 'آقا',
        2 => 'خانم',
    ],
    'App\Enums\AwardType'=>[
        1 => 'جایزه',
    ],
    'App\Enums\ProducerType'=>[
        1 => 'ناشر',
        2 => 'برند',
        3 => 'تولیدکننده',
    ],
    'App\Enums\ProductType'=>[
        1 => 'کتاب چاپی',
        2 => 'کتاب صوتی',
        3 => 'کتاب الکترونیکی',
        4 => 'لوح فشرده',
    ],
    'App\Enums\ProductStructure'=>[
        1 => 'کتاب',
        2 => 'لوازم التحریر',
        3 => 'خنزل پنزل',
    ],
    'App\Enums\AttributeType'=>[
        1 => 'چند انتخابی',
        2 => 'تک انتخابی',
        3 => 'بله یا خیر',
        4 => 'شماره',
        5 => 'رنگ',
        6 => 'متن طولانی',
        7 => 'متن',
        8 => 'وزن',
        9 => 'ابعاد'
    ],
    'App\Enums\PaymentGateway'=>[
         'SAMAN' => 'درگاه پرداخت بانک سامان',
         'MELLAT' => 'درگاه پرداخت بانک ملت',
         'PARSIAN' => 'درگاه پرداخت بانک پارسیان',
         'PASARGAD' => 'درگاه پرداخت بانک پاساردگاد',
         'PAYIR' => 'درگاه پرداخت پی دات آی آر',
         'SADERAT' => 'درگاه پرداخت بانک صادرات',
         'ZARINPAL' => 'درگاه پرداخت زرین پال',
         'IDPAY' => 'درگاه پرداخت آیدی پی',
         'ZIBAL' => 'درگاه پرداخت زیبال',
         'NEXTPAY' => 'درگاه پرداخت نکست پی'
    ]
];
